using System.Collections.Generic;

namespace Valeo.Bot.Data.Repository
{
    public static class UziInfo
    {
        private static readonly Dictionary<string, string> _descriptions = new Dictionary<string, string>();
        static UziInfo()
        {
            _descriptions.Add("usibrush",   "*УЗД органів черевної порожнини*\n\n" +
                                            "Комплексна оцінка функціонування печінки, селезінки, підшлункової залози і жовчного міхура.\n\n" +
                                            "Підготовка до дослідження: останній прийом їжі за 2-4 години до діагностики");
            _descriptions.Add("usizabrush", "*Опис УЗД органів зачеревної порожнини*\n\n" +
                                            "Ефективний метод діагностики функціонування нирок, наднирників і сечового міхура.\n\n" +
                                            "Підготовка до дослідження: за 1-1,5 години до діагностики прийом 600-800 мл. чистої води");
            _descriptions.Add("usishitov", "*УЗД щитовидної залози*\n\n" + 
                                            "Оцінка обсягу, розмірів, будови, рівномірності структури і стану контурів органу.\n\n" +
                                            "Підготовки до дослідження: ніяких дій не потрібно");
            _descriptions.Add("usimoloch", "*Опис УЗД молочної залози*\n\n" +
                                            "Оцінка обсягу, розмірів, будови, рівномірності структури і стану контурів залоз.\n\n" +
                                            "Підготовки до дослідження: ніяких дій не потрібно");
            _descriptions.Add("usimyah",    "*УЗД м'яких тканин і суглобів*\n\n"+
                                            "Дослідження дозволяє визначити наявність механічних пошкоджень, патологій, новоутворень\n\n"+
                                            "Підготовки до дослідження: ніяких дій не потрібно");
            _descriptions.Add("usilimfous", "*УЗД лімфатичних вузлів*\n\n" +
                                            "Оцінка стану лімфатичних вузлів (шийних, підщелепних, пахових, в області пахвових западин)\n\n" +
                                            "Підготовки до дослідження: ніяких дій не потрібно");
            _descriptions.Add("usitasa",    "*УЗД органів малого тазу (для жінок)*\n\n" +
                                            "Діагностика та оцінка стану здоров'я яєчників, матки і її шийки, придатків і сечового міхура.\n\n" +
                                            "Підготовка до дослідження: запис на прийом на 5-9 день менструального циклу");
            _descriptions.Add("usiserdsa",  "*УЗД серця*\n\n" +
                                            "Дозволяє оцінити роботу серцевого м'яза і стан серцевих клапанів в режимі реального часу.\n\n" +
                                            "Підготовка до дослідження: наявність дійсної електрокардіограми");
            _descriptions.Add("usisosudniz", "*УЗД судин нижніх кінцівок*\n\n" +
                                            "Перевірка стану кровотоку, артерій і наявності бляшок в судинах нижніх кінцівок\n\n" +
                                            "Підготовки до дослідження: ніяких дій не потрібно");
            _descriptions.Add("usisosudverh", "*УЗД судин верхніх кінцівок*\n\n" +
                                            "Перевірка стану кровотоку, артерій і наявності бляшок в судинах верхніх кінцівок\n\n" +
                                            "Підготовки до дослідження: ніяких дій не потрібно");
            _descriptions.Add("usisosudshei", "*УЗД судин шиї та голови*\n\n" +
                                            "Перевірка стану кровотоку, артерій і наявності бляшок в судинах шиї та голови\n\n" +
                                            "Підготовки до дослідження: ніяких дій не потрібно");
            _descriptions.Add("usineyro",   "*Нейросонографія (НСГ) або УЗД головного мозку*\n\n" +
                                            "Рання діагностика патологічних змін нервової системи у немовлят\n\n" +
                                            "Підготовка до дослідження: довжина тім'ячка немовляти не менше 1 см.");
        }

        public static string GetDescription(string command)
        {
            return _descriptions[command];
        }
    }
}